CREATE TABLE tbl_vt_psn (
    flnm  text,
    rrno  text,
    gndr  text
);

INSERT INTO tbl_vt_psn (flnm, rrno, gndr) VALUES
('피해자3', '900101-1098732', 'M'),
('피의자2', '850305-2124561', 'F'),
('피해자4', '770707-2049827', 'F'),
('피해자1', '010101-3076548', 'M'),
('피해자5', '950808-1567812', 'M'),
('피해자2', '881231-1239874', 'M'),
('피의자1', '680518-1033474', 'M');


CREATE TABLE tbl_vt_telno (
    telno   text,
    flnm    text,
    tlcmco  text
);

INSERT INTO tbl_vt_telno (telno, flnm, tlcmco) VALUES
('1099999999', '피의자1', 'KT'),
('1099011111', 'NONM', 'NOTLCMCO'),
('1000000002', '피해자2', 'KT'),
('7088888888', '콜센터', 'NOTLCMCO'),
('1000000001', '피해자1', 'SKT'),
('1000000003', '피해자3', 'LGT'),
('NOTELNO', 'NONM', 'NOTLCMCO'),
('1000000005', '피해자5', 'SKT'),
('1084573455', '피의자2', 'KT'),
('1000000004', '피해자4', 'KT');



CREATE TABLE tbl_vt_bacnt (
    actno text,
    dpstr text,
    bank  text
);

INSERT INTO tbl_vt_bacnt (actno, dpstr, bank) VALUES
('110-2222-2222', '피해자2', '국민은행'),
('현금인출', 'NONM', 'NOBANKNM'),
('110-5555-5555', '피해자5', '국민은행'),
('200-8888-888888', '피의자2', '부산은행'),
('110-1111-1111', '피해자1', '국민은행'),
('110-3333-3333', '피해자3', '국민은행'),
('110-4444-4444', '피해자4', '국민은행'),
('200-9999-999999', '피의자1', '새마을금고');



CREATE TABLE tbl_eg_telno_poss (
    flnm  text,
    telno text
);
INSERT INTO tbl_eg_telno_poss (flnm, telno) VALUES
('피의자1', '1099999999'),
('피해자1', '1000000001'),
('피해자2', '1000000002'),
('피해자3', '1000000003'),
('피해자4', '1000000004'),
('피해자5', '1000000005'),
('NONM', '1099011111'),
('피의자2', '1084573455');


CREATE TABLE tbl_eg_bactno_poss (
    flnm  text,
    actno text
);
INSERT INTO tbl_eg_bactno_poss (flnm, actno) VALUES
('피의자2', '200-8888-888888'),
('피의자1', '200-9999-999999'),
('피해자1', '110-1111-1111'),
('피해자2', '110-2222-2222'),
('피해자3', '110-3333-3333'),
('피해자4', '110-4444-4444'),
('피해자5', '110-5555-5555'),
('NONM', '현금인출');

CREATE TABLE tbl_eg_call (
    id text,
    flnm          text,
    telno         text,
    rcv_flnm      text,
    rcv_telno     text,
    bgng_ymdhm    timestamp,
    end_ymdhm     timestamp,
    tlcmco text,
    se            text,
    rmrk          text
);
INSERT INTO tbl_eg_call
(id, flnm, telno, rcv_flnm, rcv_telno, bgng_ymdhm, end_ymdhm, tlcmco, se, rmrk)
VALUES
(1,'피해자1',1000000001,'피의자1',1099999999,'2025-06-10 09:04:00','2025-06-10 09:07:00','SKT','음성','콜센터 연결'),
(2,'피해자1',1000000001,'피의자1',1099999999,'2025-06-10 09:00:00','2025-06-10 09:03:00','SKT','음성','초기 연락'),
(3,'피해자2',1000000002,'피의자1',1099999999,'2025-06-10 10:39:00','2025-06-10 10:42:00','KT','음성','콜센터 연결'),
(4,'피해자2',1000000002,'피의자1',1099999999,'2025-06-10 10:35:00','2025-06-10 10:38:00','KT','음성','초기 연락'),
(5,'피해자3',1000000003,'피의자1',1099999999,'2025-06-10 11:14:00','2025-06-10 11:17:00','LGT','음성','콜센터 연결'),
(6,'피해자3',1000000003,'피의자1',1099999999,'2025-06-10 11:10:00','2025-06-10 11:13:00','LGT','음성','초기 연락'),
(7,'피해자4',1000000004,'피의자1',1099999999,'2025-06-10 15:19:00','2025-06-10 15:22:00','KT','음성','콜센터 연결'),
(8,'피해자4',1000000004,'피의자1',1099999999,'2025-06-10 15:15:00','2025-06-10 15:18:00','KT','음성','초기 연락'),
(9,'피해자5',1000000005,'피의자1',1099999999,'2025-06-10 17:24:00','2025-06-10 17:27:00','SKT','음성','콜센터 연결'),
(10,'피해자5',1000000005,'피의자1',1099999999,'2025-06-10 17:20:00','2025-06-10 17:23:00','SKT','음성','초기 연락'),
(11,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 09:10:00','2025-06-10 09:10:30','KT이동','음성','인출 전 연락'),
(12,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 09:15:00','2025-06-10 09:15:40','KT이동','음성','인출 후 연락'),
(13,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 10:45:00','2025-06-10 10:45:30','KT이동','음성','인출 전 연락'),
(14,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 10:50:00','2025-06-10 10:50:40','KT이동','음성','인출 후 연락'),
(15,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 11:20:00','2025-06-10 11:20:30','KT이동','음성','인출 전 연락'),
(16,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 11:25:00','2025-06-10 11:25:40','KT이동','음성','인출 후 연락'),
(17,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 15:25:00','2025-06-10 15:25:30','KT이동','음성','인출 전 연락'),
(18,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 15:30:00','2025-06-10 15:30:40','KT이동','음성','인출 후 연락'),
(19,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 17:30:00','2025-06-10 17:30:30','KT이동','음성','인출 전 연락'),
(20,'피의자2',1084573455,'피의자1',1099999999,'2025-06-10 17:35:00','2025-06-10 17:35:40','KT이동','음성','인출 후 연락'),
(21,'피의자1',1099999999,'피의자2',1084573455,'2025-06-10 09:04:00','2025-06-10 09:17:30','KT이동','인터넷접속','NORMRK'),
(22,'피의자1',1099999999,'피의자2',1084573455,'2025-06-10 10:39:00','2025-06-10 10:47:00','KT이동','인터넷접속','NORMRK'),
(23,'피의자1',1099999999,'피의자2',1084573455,'2025-06-10 11:13:00','2025-06-10 11:30:30','KT이동','인터넷접속','NORMRK'),
(24,'피의자1',1099999999,'피의자2',1084573455,'2025-06-10 15:15:00','2025-06-10 15:30:30','KT이동','인터넷접속','NORMRK'),
(25,'피의자1',1099999999,'피의자2',1084573455,'2025-06-10 17:17:00','2025-06-10 17:40:40','KT이동','인터넷접속','NORMRK');

CREATE TABLE tbl_eg_rmt (
    id              integer,
    se              text,
    dpstr           text,
    bank            text,
    actno           text,
    rmt_se          text,
    dpst_amt        numeric,
    abstr           text,
    tkmny_amt       numeric,
    rlt_bank        text,
    rlt_dpstr       text,
    rlt_actno       text,
    ip              text,
    rcptn_trmnlno   text,
    rmt_ymdhm       timestamp
);
INSERT INTO tbl_eg_rmt
(id,se,dpstr,bank,actno,rmt_se,dpst_amt,abstr,tkmny_amt,
 rlt_bank,rlt_dpstr,rlt_actno,ip,rcptn_trmnlno,rmt_ymdhm)
VALUES
(1,'입금','피의자1','새마을금고','200-9999-999999','이체',500000,'NOABSTR',0,'국민은행','피해자1','110-1111-1111',NULL,NULL,'2025-06-10 09:05:00'),
(2,'입금','피의자1','새마을금고','200-9999-999999','이체',700000,'NOABSTR',0,'국민은행','피해자2','110-2222-2222',NULL,NULL,'2025-06-10 10:40:00'),
(3,'입금','피의자1','새마을금고','200-9999-999999','이체',500000,'NOABSTR',0,'국민은행','피해자3','110-3333-3333',NULL,NULL,'2025-06-10 11:15:00'),
(4,'입금','피의자1','새마을금고','200-9999-999999','이체',500000,'NOABSTR',0,'국민은행','피해자4','110-4444-4444',NULL,NULL,'2025-06-10 15:20:00'),
(5,'입금','피의자1','새마을금고','200-9999-999999','이체',1000000,'NOABSTR',0,'국민은행','피해자5','110-5555-5555',NULL,NULL,'2025-06-10 17:25:00'),
(6,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',500000,'NOBANKNM','ATM출금','ATM-부산002',NULL,'WEB-0002','2025-06-10 09:12:00'),
(7,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',500000,'NOBANKNM','ATM출금','ATM-부산001',NULL,'WEB-0002','2025-06-10 09:12:00'),
(8,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',700000,'NOBANKNM','ATM출금','ATM-부산002',NULL,'WEB-0002','2025-06-10 10:47:00'),
(9,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',700000,'NOBANKNM','ATM출금','ATM-부산002',NULL,'WEB-0002','2025-06-10 10:47:00'),
(10,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',500000,'NOBANKNM','ATM출금','ATM-부산002',NULL,'WEB-0002','2025-06-10 11:22:00'),
(11,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',500000,'NOBANKNM','ATM출금','ATM-부산003',NULL,'WEB-0002','2025-06-10 11:22:00'),
(12,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',500000,'NOBANKNM','ATM출금','ATM-부산002',NULL,'WEB-0002','2025-06-10 15:27:00'),
(13,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',500000,'NOBANKNM','ATM출금','ATM-부산004',NULL,'WEB-0002','2025-06-10 15:27:00'),
(14,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',1000000,'NOBANKNM','ATM출금','ATM-부산002',NULL,'WEB-0002','2025-06-10 17:32:00'),
(15,'출금','피의자2','부산은행','200-8888-888888','현금인출',0,'ATM출금',1000000,'NOBANKNM','ATM출금','ATM-부산005',NULL,'WEB-0002','2025-06-10 17:32:00'),
(16,'출금','피의자1','새마을금고','200-9999-999999','이체',0,'대포계좌2',500000,'부산은행','피의자2','200-8888-888888','152.38.1.150',NULL,'2025-06-10 09:08:00'),
(17,'출금','피의자1','새마을금고','200-9999-999999','이체',0,'대포계좌2',700000,'부산은행','피의자2','200-8888-888888','211.38.1.150',NULL,'2025-06-10 10:43:00'),
(18,'출금','피의자1','새마을금고','200-9999-999999','이체',0,'대포계좌2',500000,'부산은행','피의자2','200-8888-888888','103.38.1.160',NULL,'2025-06-10 11:18:00'),
(19,'출금','피의자1','새마을금고','200-9999-999999','이체',0,'대포계좌2',500000,'부산은행','피의자2','200-8888-888888','103.38.1.169',NULL,'2025-06-10 15:23:00'),
(20,'출금','피의자1','새마을금고','200-9999-999999','이체',0,'대포계좌2',1000000,'부산은행','피의자2','200-8888-888888','203.108.1.223',NULL,'2025-06-10 17:28:00');